import React from 'react'
import './City.css'
import cite1 from '../../Assets/490796db-22fd-4cf2-9435-9437969189cb.jpeg'
import cite2 from '../../Assets/قلبي المتيم يا عراب.jpeg'
import cite3 from '../../Assets/📍🇱🇾Libya, Tripoli.jpeg'
import cite4 from '../../Assets/Beautiful Egypt by moamen Elmenshawy .jpeg'
import cite5 from '../../Assets/images.jpg'
import cite6 from '../../Assets/af0c4225-ff7e-4cd5-a247-f43217b15c8b.jpg'
import cite7 from '../../Assets/_ فبعزّتك استجِب لي دُعائي وبلّغني مُناي .jpeg'
import cite8 from '../../Assets/d3a2ac54-7ace-4791-90d2-06ecc1f2dc17.jpeg'
import cite9 from '../../Assets/b54b7e4f-ef20-4b69-8e9b-a1cf304e6848.jpeg'


function City() {
  return (
    <div className='city'>
        <div className='conter'>
          <div className='cit1'>
            <img className='cite1' src={cite1} alt="cit1" />
              <p>
            هذه الصورة تظهر دار الحجر في اليمن، وهو قصر تاريخي يقع في منطقة وادي ظهر شمال غرب صنعاء.
             دار الحجر يُعد من أبرز المعالم السياحية والتاريخية في اليمن، وهو مبني فوق صخرة ضخمة ويعود تاريخه إلى القرن الثامن عشر.  
            </p>
            </div> 

            <div className='cit2'>
                <img  className='cite2' src={cite2} alt="cit2" />
                <p>
                هذه الصورة تظهر مدينة صنعاء القديمة في اليمن، مع إطلالة على جامع الصالح، الذي يُعد من أكبر وأشهر المساجد في صنعاء. 
                المدينة القديمة معروفة بتصميمها المعماري الفريد والمباني المبنية من الطين، والتي تعود إلى مئات السنين، وهي إحدى مواقع التراث العالمي لليونسكو.
                </p>
            </div>

            <div className='cit3'>
                <img  className='cite3' src={cite3} alt="cit3" />
                <p>
                هذه الصورة تُظهر "قلعة السرايا الحمراء" في العاصمة الليبية طرابلس. القلعة تقع بالقرب من ميناء طرابلس وهي من أهم المعالم التاريخية في المدينة.
                 بنيت القلعة في العصور الوسطى وتعتبر رمزاً من رموز التراث الليبي، حيث تحتوي على متاحف وأثار تاريخية تعكس ثقافة وتاريخ ليبيا.
                </p>
            </div> 
           
        </div>


        <div className='conter2'>
        <div className='cit4'>
                <img  className='cite4' src={cite4} alt="cit4" />
                <p>
                هرم سقارة، المعروف أيضًا باسم هرم زوسر، هو أول هرم بُني في مصر القديمة ويعتبر أقدم بناء حجري ضخم في العالم. 
                تم تشييده في القرن الـ27 قبل الميلاد خلال فترة حكم الملك زوسر (حوالي 2670 ق.م.)، وهو الفرعون الثاني من الأسرة الثالثة في الدولة القديمة.
               </p>
            </div> 

          <div className='cit5'>
            <img className='cite5' src={cite5} alt="cit5" />
            <p>
            في الصورة هو فندق الماسة، وهو أحد أشهر الفنادق والمنتجعات الفاخرة في مدينة العلمين الجديدة.
             الفندق يقع بالقرب من الساحل الشمالي ويشتهر بتصميمه العصري والخدمات الفاخرة التي يقدمها للنزلاء.
مدينة العلمين الجديدة تمثل رمزًا للتطور المعماري الحديث في مصر وتعتبر وجهة مميزة للسياحة والاستثمار.
            </p>
            </div> 

            <div className='cit6'>
                <img  className='cite6' src={cite6} alt="cit6" />
                <p>
                مسجد السلطان سليم الأول، المعروف أيضًا باسم جامع سليم الأول أو جامع ياووز سليم،
                 هو واحد من أبرز المساجد العثمانية في مدينة إسطنبول، تركيا. يتميز هذا المسجد بتصميمه المعماري المميز وموقعه المطل على مضيق البوسفور، ويعتبر من المعالم التاريخية والدينية الهامة في المدينة.
                </p>
            </div>
            </div>


            <div className='conter3'>
            <div className='cit7'>
                <img  className='cite7' src={cite7} alt="cit7" />
                <p>
                هذه الصورة تظهر منظرًا من مدينة المدينة المنورة في المملكة العربية السعودية، تحديدًا جزءًا من المسجد النبوي الشريف، 
                أحد أهم وأقدس المساجد في الإسلام. يظهر في الصورة مئذنة من مآذن المسجد النبوي، 
                وتبدو المظلات المتحركة التي تغطي ساحات المسجد، والتي تستخدم لحماية المصلين من الشمس.
                </p>
            </div> 

            <div className='cit8'>
                <img  className='cite8' src={cite8} alt="cit8" />
                <p>
                الكعبة المشرفة هي أقدس بيت في الإسلام وتعد قبلة المسلمين في صلواتهم في جميع أنحاء العالم.
                 تقع في وسط المسجد الحرام في مكة المكرمة، السعودية. يرتبط تاريخ الكعبة بأحداث تاريخية ودينية هامة، وتعتبر رمزًا للوحدة بين المسلمين.
               </p>
            </div>

            <div className='cit9'>
                <img  className='cite9' src={cite9} alt="cit9" />
                <p>
                بلجيكا هي دولة تقع في غرب أوروبا، وتُعرف بتنوعها الثقافي واللغوي وموقعها الجغرافي المهم في قلب القارة الأوروبية.
                 إليك بعض المعلومات الأساسية عن بلجيكا:
               </p>
            </div> 

        </div>
      
    </div>
  )
}

export default City
